app/Http/Controllers/Front/HomepageController.php

    public function index()
    {
        resizeExistingImages("products");
        resizeExistingImages("collections");

        // todo :: Make the code more efficient
        $all_products = [];
        $all_collections = [];

        ############## Get All Active Sections with Relations :: Start ##############
        $sections = Section::with([
            'products' => fn ($q) => $q
                ->select(['products.id', 'products.publish'])
                ->where('products.publish', 1)
                ->with('brand')
                ->withPivot('rank')
                ->orderBy('rank'),
            'collections' => fn ($q) => $q
                ->select(['collections.id', 'collections.publish'])
                ->where('collections.publish', 1)
                ->withPivot('rank')
                ->orderBy('rank'),
            'offer' => fn ($q) => $q->with([
                'directProducts' => fn ($q) => $q->with('brand')->where('products.publish', 1),
                'directCollections' => fn ($q) => $q->where('collections.publish', 1),
                'supercategoryProducts' => fn ($q) => $q->where('products.publish', 1),
                'categoryProducts' => fn ($q) => $q->where('products.publish', 1),
                'subcategoryProducts' => fn ($q) => $q->where('products.publish', 1),
                'brandProducts' => fn ($q) => $q->where('products.publish', 1),
            ]),
            'banners'
        ])
            ->where('active', 1)
            ->orderBy('rank')->get();
---
select * from `brands` where `brands`.`id` in (1, 2, 3, 4) and `brands`.`deleted_at` is null