app/Http/Controllers/Front/HomepageController.php

select * from `offers` where `offers`.`id` in (1, 2)
select * from `sections` where `active` = 1 order by `rank` asc
select `banners`.*, `banner_section`.`section_id` as `pivot_section_id`, `banner_section`.`banner_id` as `pivot_banner_id` from `banners` inner join `banner_section` on `banners`.`id` = `banner_section`.`banner_id` where `banner_section`.`section_id` in (1, 4, 5, 6)
select `subcategories`.*, `product_subcategory`.`product_id` as `pivot_product_id`, `product_subcategory`.`subcategory_id` as `pivot_subcategory_id` from `subcategories` inner join `product_subcategory` on `subcategories`.`id` = `product_subcategory`.`subcategory_id` where `product_subcategory`.`product_id` in (2, 3, 5, 6) and `subcategories`.`deleted_at` is null
---
    public function index()
    {

        ############## Get All Active Sections with Relations :: Start ##############
        $sections = Section::with([
            'products' => fn ($q) => $q->publishedproduct()->withPivot('rank')->orderBy('rank'),
            'offers' => fn ($q) => $q->with([
                'directProducts' => fn ($q) => $q->where('publish', 1),
                'supercategoryProducts' => fn ($q) => $q->where('publish', 1),
                'categoryProducts' => fn ($q) => $q->where('publish', 1),
                'subcategoryProducts' => fn ($q) => $q->where('publish', 1),
                'brandProducts' => fn ($q) => $q->where('publish', 1),
            ]),
            'banners'
        ])->where('active', 1)->orderBy('rank')->get();
        ############## Get All Active Sections with Relations :: End ##############

        ############ Extract of products From Sections :: Start ############
        foreach ($sections as $section) {
            if ($section->products->count()) {
                $section->products->map(function ($product) {
                    // Get All Product's Prices -- Start with Product's Final Price
                    $all_prices = [$product->final_price];

                    // Get All Product's Points -- Start with Product's Points
                    $all_points = [$product->points];

                    // Get Free Shipping
                    $free_shipping = $product->free_shipping;

                    // Get All Subcategories
                    $subcategories = $product->subcategories ? $product->subcategories->map(fn ($subcategory) => $subcategory->id) : [];

                    // Get All Categories
                    $categories = $subcategories ? $product->subcategories->map(fn ($subcategory) => $subcategory->category) : [];
                    // Get All Supercategories
                    $supercategories = $categories ? $categories->map(fn ($category) => $category->supercategory) : [];

                    // Get Final Prices From Direct Offers
                    $direct_offers = $product->offers->map(fn ($offer) => ['free_shipping' => $offer->free_shipping, 'value' => $offer->pivot->value, 'type' => $offer->pivot->type, 'number' => $offer->pivot->number]);
                    foreach ($direct_offers as $offer) {