app/Http/Controllers/Front/ProductController.php

    public function show($id, $slug = null): Factory|View
    {
        // Get the product
        $product = Product::with([
            'specs',
            'images' => fn($q) => $q->where('is_thumbnail', 0)->orderBy('featured', 'desc'),
            'brand',
            'reviews' => fn($q) => $q->with('user')->orderBy('created_at', 'desc'),
            'relatedProducts:id',
            'relatedCollections:id',
            'complementedProducts:id',
            'complementedCollections:id',
        ])
            ->where('publish', 1)
            ->findOrFail($id);
---
select * from `brands` where `brands`.`id` in (1) and `brands`.`deleted_at` is null