app/Http/Livewire/Admin/Supercategories/SupercategoriesDatatable.php

select count(*) as aggregate from `supercategories` where (json_unquote(json_extract(`name`, '$."ar"')) like '%%' or json_unquote(json_extract(`name`, '$."en"')) like '%%') and `supercategories`.`deleted_at` is null
---
    public function render()
    {
        $supercategories = Supercategory::select([
            'id',
            'name',
            'icon',
        ])
            ->withCount('categories')
            ->withCount('subcategories')
            ->where(function ($q) {
                return $q
                    ->where('name', 'like', '%' . $this->search . '%');
            })
            ->orderBy($this->sortBy, $this->sortDirection)->paginate($this->perPage);