app/Http/Livewire/Front/Homepage/MainSlider.php

    public function mount()
    {
        $this->banners = Banner::where('rank', '<=', 10)->orderBy('rank')->get();

        $this->topSupercategories = Supercategory::select('id', 'name', 'icon', 'top')->with([
            'categories' => function ($q) {
                $q->select('id', 'name', 'supercategory_id')
                    ->with(['subcategories' => function ($q) {
                        $q->select('id', 'name', 'category_id');
                    }]);
            }
        ])->where('top', '>', 0)->orderBy('top')->get();

        $this->topSubcategories = Subcategory::select('id', 'name', 'image_name', 'top')->where('top', '>', 0)->orderBy('top')->take(5)->get();
---
select * from `banners` where `rank` <= 10 order by `rank` asc
select `id`, `name`, `category_id` from `subcategories` where `subcategories`.`category_id` in (1, 2, 3, 6, 7, 8, 9) and `subcategories`.`deleted_at` is null
select `id`, `name`, `icon`, `top` from `supercategories` where `top` > 0 and `supercategories`.`deleted_at` is null order by `top` asc
select `id`, `name`, `supercategory_id` from `categories` where `categories`.`supercategory_id` in (1, 3, 4) and `categories`.`deleted_at` is null
select `id`, `name`, `image_name`, `top` from `subcategories` where `top` > 0 and `subcategories`.`deleted_at` is null order by `top` asc limit 5