app/Http/Livewire/Front/Homepage/TopBanner.php

    public function mount()
    {
        $this->banner = Banner::where('top_banner', 1)->first();
---
select * from `banners` where `top_banner` = 1 limit 1