app/helpers.php

function get_product_rating($product_id)
{
    $all_product_reviews = Review::with([
        'user' => fn ($q) => $q->select('id', 'f_name', 'l_name', 'profile_photo_path')
    ])
        ->where('product_id', $product_id)
        ->approved()->get();
---
select `id`, `f_name`, `l_name`, `profile_photo_path` from `users` where `users`.`id` in (2, 6, 21, 52) and `users`.`deleted_at` is null