app/helpers.php

select `subcategories`.*, `product_subcategory`.`product_id` as `pivot_product_id`, `product_subcategory`.`subcategory_id` as `pivot_subcategory_id` from `subcategories` inner join `product_subcategory` on `subcategories`.`id` = `product_subcategory`.`subcategory_id` where `product_subcategory`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12) and `subcategories`.`deleted_at` is null
---
function getBestOfferForProducts($products_id)
{
    $products = Product::publishedproducts($products_id)->get();

    foreach ($products as $key => $product) {
        ############ Get Best Offer for all products :: Start ############
        // Get All Product's Prices -- Start with Product's Final Price
        $offers_discount = [0];

        // Get All Product's Points -- Start with Product's Points
        $offers_points = [0];

        // Get Free Shipping
        $free_shipping = $product->free_shipping;

        // Get All Subcategories
        $subcategories = $product->subcategories ? $product->subcategories->map(fn ($subcategory) => $subcategory->id) : [];