app/Http/Livewire/Admin/Governorates/GovernoratesDatatable.php

    public function render()
    {
        $governorates = Governorate::with(['country' => function ($query) {
            $query->withTrashed();
        }, 'deliveries', 'users', 'cities'])
            ->join('countries', 'countries.id', '=', 'governorates.country_id')
            ->select('governorates.*', 'countries.name as country_name')
            ->withCount('users')
            ->withCount('deliveries')
            ->withCount('cities')
            ->where(function ($query) {
                return $query
                    ->where('governorates.name->en', 'like', '%' . $this->search . '%')
                    ->orWhere('governorates.name->ar', 'like', '%' . $this->search . '%')
                    ->orWhere('countries.name->en', 'like', '%' . $this->search . '%')
                    ->orWhere('countries.name->ar', 'like', '%' . $this->search . '%');
            })
            ->orderBy($this->sortBy, $this->sortDirection)
            ->paginate($this->perPage);
---
select count(*) as aggregate from `governorates` inner join `countries` on `countries`.`id` = `governorates`.`country_id` where (json_unquote(json_extract(`governorates`.`name`, '$."en"')) like '%%' or json_unquote(json_extract(`governorates`.`name`, '$."ar"')) like '%%' or json_unquote(json_extract(`countries`.`name`, '$."en"')) like '%%' or json_unquote(json_extract(`countries`.`name`, '$."ar"')) like '%%') and `governorates`.`deleted_at` is null