app/Http/Livewire/Admin/Homepage/Todaydeals/TodayDealsList.php

    public function render()
    {
        $products = Product::select(['id', 'name', 'base_price', 'final_price', 'free_shipping', 'today_deal'])
            ->with(['thumbnail'])
            ->where('today_deal', '>', 0)
            ->where('under_reviewing', '=', 0)
            ->where(function ($q) {
                $q->where('name->ar', 'like', '%' . $this->search . '%')
                    ->orWhere('name->en', 'like', '%' . $this->search . '%')
                    ->orWhere('base_price', 'like', '%' . $this->search . '%')
                    ->orWhere('final_price', 'like', '%' . $this->search . '%')
                    ->orWhere('points', 'like', '%' . $this->search . '%');
            })
            ->orderBy('today_deal')
            ->paginate($this->perPage);

        $this->products_list = Product::select(['id', 'name', 'base_price', 'final_price', 'free_shipping', 'today_deal', 'brand_id'])
            ->with(['brand' => function ($q) {
                $q->select('id', 'name');
            }])
            ->where('under_reviewing', '=', 0)
            ->where('today_deal', '=', 0)
            ->where(function ($q) {
                $q->where('name->ar', 'like', '%' . $this->searchProduct . '%')
                    ->orWhere('name->en', 'like', '%' . $this->searchProduct . '%')
                    ->orWhere('base_price', 'like', '%' . $this->searchProduct . '%')
                    ->orWhere('final_price', 'like', '%' . $this->searchProduct . '%')
                    ->orWhere('points', 'like', '%' . $this->searchProduct . '%');
            })
            ->get();
---
select `id`, `name` from `brands` where `brands`.`id` in (1, 2, 3, 4) and `brands`.`deleted_at` is null
select `id`, `name`, `base_price`, `final_price`, `free_shipping`, `brand_id` from `products` where `under_reviewing` = 0 and `id` not in (2, 5, 6) and (json_unquote(json_extract(`name`, '$."ar"')) like '%%' or json_unquote(json_extract(`name`, '$."en"')) like '%%' or `base_price` like '%%' or `final_price` like '%%' or `points` like '%%') and `products`.`deleted_at` is null