app/Http/Livewire/Admin/Homepage/SectionsList.php

    public function render()
    {
        $sections = Section::where('title->en', '!=', "Today's Deal")
            ->where(fn ($q) => $q
                ->where('title->en', 'like', "%" . $this->search . "%")
                ->orWhere('title->ar', 'like', "%" . $this->search . "%"))
            ->orderBy('rank', $this->sortDirection)
            ->paginate($this->perPage);
---
select * from `sections` where json_unquote(json_extract(`title`, '$."en"')) != 'Today\'s Deal' and (json_unquote(json_extract(`title`, '$."en"')) like '%%' or json_unquote(json_extract(`title`, '$."ar"')) like '%%') order by `rank` asc limit 10 offset 0
select count(*) as aggregate from `sections` where json_unquote(json_extract(`title`, '$."en"')) != 'Today\'s Deal' and (json_unquote(json_extract(`title`, '$."en"')) like '%%' or json_unquote(json_extract(`title`, '$."ar"')) like '%%')